Revit 2024 API
ConnectionInputPoint Constructor (XYZ, Guid)
 Construct an input point from 3d point and id.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ConnectionInputPoint(
	XYZ pt,
	Guid uid
)
Visual Basic
Public Sub New ( _
	pt As XYZ, _
	uid As Guid _
)
Visual C++
public:
ConnectionInputPoint(
	XYZ^ pt,
	Guid uid
)
Parameters
pt
Type: Autodesk.Revit.DB.XYZ
uid
Type: System.Guid
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConnectionInputPoint Class
ConnectionInputPoint Overload
Autodesk.Revit.DB.Structure Namespace